<a href="https://colab.research.google.com/github/sampath11/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/Sam_Kumar_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-19 02:58:42--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.37.158
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.37.158|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  46.5MB/s    in 4.6s

2019-09-19 02:58:47 (42.6 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
##### YOUR CODE HERE #####
import pandas as pd

order_products_prior = pd.read_csv ("order_products__prior.csv")

order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
order_products_prior.shape

(32434489, 4)

In [7]:
order_products_train = pd.read_csv ("order_products__train.csv")

order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [8]:
order_products_train.shape

(1384617, 4)

In [9]:
order_products = pd.concat ([order_products_train, order_products_prior])

order_products.shape

(33819106, 4)

In [10]:
order_products.head(30)

    order_id  product_id  add_to_cart_order  reordered
0          1       49302                  1          1
1          1       11109                  2          1
2          1       10246                  3          0
3          1       49683                  4          0
4          1       43633                  5          1
5          1       13176                  6          0
6          1       47209                  7          0
7          1       22035                  8          1
8         36       39612                  1          0
9         36       19660                  2          1
10        36       49235                  3          0
11        36       43086                  4          1
12        36       46620                  5          1
13        36       34497                  6          1
14        36       48679                  7          1
15        36       46979                  8          1
16        38       11913                  1          0
17        38       18159                  2          0
18        38        4461                  3          0
19        38       21616                  4          1
20        38       23622                  5          0
21        38       32433                  6          0
22        38       28842                  7          0
23        38       42625                  8          0
24        38       39693                  9          0
25        96       20574                  1          1
26        96       30391                  2          0
27        96       40706                  3          1
28        96       25610                  4          0
29        96       27966                  5          1

In [11]:
products = pd.read_csv ("products.csv")

products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [12]:
columns = ['product_id','product_name']

subset_products = products[columns]

subset_products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [15]:
columns = ['order_id', 	'product_id', 	'add_to_cart_order', 	'reordered']

merged = pd.merge (order_products[columns], subset_products)
merged.head(30)

    order_id  product_id  add_to_cart_order  reordered      product_name
0          1       49302                  1          1  Bulgarian Yogurt
1     816049       49302                  7          1  Bulgarian Yogurt
2    1242203       49302                  1          1  Bulgarian Yogurt
3    1383349       49302                 11          1  Bulgarian Yogurt
4    1787378       49302                  8          0  Bulgarian Yogurt
5    2445303       49302                  2          1  Bulgarian Yogurt
6    2853065       49302                 12          1  Bulgarian Yogurt
7    3231517       49302                  6          1  Bulgarian Yogurt
8      38841       49302                  5          1  Bulgarian Yogurt
9      45900       49302                 19          0  Bulgarian Yogurt
10     76491       49302                  2          1  Bulgarian Yogurt
11     78201       49302                  5          1  Bulgarian Yogurt
12    142824       49302                  8          0  Bulgarian Yogurt
13    175716       49302                  2          1  Bulgarian Yogurt
14    191070       49302                  4          0  Bulgarian Yogurt
15    212143       49302                  2          0  Bulgarian Yogurt
16    258521       49302                  5          0  Bulgarian Yogurt
17    262316       49302                  1          0  Bulgarian Yogurt
18    269385       49302                  1          1  Bulgarian Yogurt
19    274066       49302                  5          0  Bulgarian Yogurt
20    277380       49302                 14          0  Bulgarian Yogurt
21    312335       49302                  1          1  Bulgarian Yogurt
22    316883       49302                  1          0  Bulgarian Yogurt
23    323432       49302                  9          0  Bulgarian Yogurt
24    337031       49302                  2          1  Bulgarian Yogurt
25    353181       49302                  7          1  Bulgarian Yogurt
26    364435       49302                  7          1  Bulgarian Yogurt
27    375739       49302                  7          0  Bulgarian Yogurt
28    384816       49302                  5          1  Bulgarian Yogurt
29    442843       49302                 11          1  Bulgarian Yogurt

In [16]:
merged[merged['order_id'] == 2539329]

          order_id  ...                             product_name
5826535    2539329  ...                                     Soda
14600144   2539329  ...               Aged White Cheddar Popcorn
16004522   2539329  ...  Organic Unsweetened Vanilla Almond Milk
21265652   2539329  ...         XL Pick-A-Size Paper Towel Rolls
23919216   2539329  ...                      Original Beef Jerky

[5 rows x 5 columns]

In [17]:
products[products['product_id'] == 26405 ]

       product_id                      product_name  aisle_id  department_id
26404       26405  XL Pick-A-Size Paper Towel Rolls        54             17

In [18]:
merged[merged['product_name'] == 'Banana'].count()

order_id             491291
product_id           491291
add_to_cart_order    491291
reordered            491291
product_name         491291
dtype: int64

In [23]:
merged[merged['product_name'] == 'Bag of Organic Bananas'].count()

order_id             394930
product_id           394930
add_to_cart_order    394930
reordered            394930
product_name         394930
dtype: int64

In [24]:
merged[merged['product_name'] == 'Organic Whole Milk'].count()

order_id             142813
product_id           142813
add_to_cart_order    142813
reordered            142813
product_name         142813
dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [52]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [53]:
table1.index

Index(['John Smith', 'Jane Doe', 'Mary Johnson'], dtype='object')

In [0]:
table1 = table1.reset_index()

In [55]:
tidy = table1.melt(id_vars='index')
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [50]:
tidy.columns = ['name', 'trt', 'result']
tidy

           name         trt  result
0    John Smith     level_0     0.0
1      Jane Doe     level_0     1.0
2  Mary Johnson     level_0     2.0
3    John Smith  treatmenta     NaN
4      Jane Doe  treatmenta    16.0
5  Mary Johnson  treatmenta     3.0
6    John Smith  treatmentb     2.0
7      Jane Doe  treatmentb    11.0
8  Mary Johnson  treatmentb     1.0

In [31]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [45]:
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [46]:
table1.index

RangeIndex(start=0, stop=3, step=1)

In [56]:
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [57]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [59]:
table2.index

Index(['treatmenta', 'treatmentb'], dtype='object')

In [0]:
table2 = table2.reset_index()

In [61]:
tidy = table2.melt(id_vars='index')
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [62]:
tidy.columns = ['name', 'variable', 'value']
tidy

         name      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
import seaborn as sns

In [0]:
flights = sns.load_dataset('flights')

In [28]:
##### YOUR CODE HERE #####

flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####